Autodesk.Revit.DB.Geolocation.Services.UnitConversionOptions.SetLinearUnit(Autodesk.Revit.DB.ForgeTypeId)
set the desired unit to use when converting linear data.
linearUnit:
linear unit to use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Geolocation.Services.UnitConversionOptions.GetLinearUnit
access to the desired unit to use when converting linear data.
Returns:
linear unit to use.

Autodesk.Revit.DB.Geolocation.Services.UnitConversionOptions.SetAngleUnit(Autodesk.Revit.DB.ForgeTypeId)
set the desired unit to use when converting angle type data.
angleUnit:
angle unit to use.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Geolocation.Services.UnitConversionOptions.GetAngleUnit
access to the desired unit to use when converting angle type data.
Returns:
the angle unit to use.

Autodesk.Revit.DB.Geolocation.Services.UnitConversionOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Geolocation.Services.UnitConversionOptions
A collection of options used by the service when
determining what units to use in any conversions.